        identification division.
        program-id. CALC1.
        *---  ESTE PROGRAMA CALCULAR DIFERENCA PERCENTUAL ENTRE VALOR 
        
        environment division.
        configuration section.
        
        data division.
        working-storage section.
        
        procedure division.
        main.
            display "Calcular porcentagem entre dois valores ".
        
        end program CALC1.
